In [1]:
import pandas as pd

data1 = pd.read_csv('data/2024-08-06 11_52pm.csv')
data1.head(1)

,LIVEDATA_COMPANY_ID,COMPANY_NAME,WEBSITE,LINKEDIN_SLUG,COMPANY_TYPE,FOUNDED_YEAR,INDUSTRY,COMPANY_LOCATION,EMPLOYEE_COUNT,SIC_CODES,TICKER,INFO_CHANGE_DETECTED_AT,DS
0,683d81648fa088c6e63fd794304c6809,divergence neuro,divergenceneuro.com,divergenceneuro,privately held,2020.0,biotechnology,"Toronto, Ontario",10.0,NaN,NaN,2024-05-10 10:18:55.073 Z,2024-06-05 00:00:00.000 Z

In [2]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26504 entries, 0 to 26503
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   LIVEDATA_COMPANY_ID      26504 non-null  object
 1   COMPANY_NAME             26503 non-null  object
 2   WEBSITE                  26504 non-null  object
 3   LINKEDIN_SLUG            26504 non-null  object
 4   COMPANY_TYPE             18938 non-null  object
 5   FOUNDED_YEAR             15092 non-null  float64
 6   INDUSTRY                 24449 non-null  object
 7   COMPANY_LOCATION         21585 non-null  object
 8   EMPLOYEE_COUNT           22036 non-null  float64
 9   SIC_CODES                1300 non-null   object
 10  TICKER                   68 non-null     object
 11  INFO_CHANGE_DETECTED_AT  26504 non-null  object
 12  DS                       26504 non-null  object
dtypes: float64(2), object(11)
memory usage: 2.6+ MB

In [3]:
data2 = pd.read_csv('data/2024-08-06 11_52pm_1.csv')
data2.head(1)

,DS,PDL_COMPANY_ID,COMPANY_NAME,TYPE,INDUSTRY,WEBSITE,FOUNDED,LINKEDIN_URL,PDL_SUMMARY,FACEBOOK_URL,...,COMPANY_LOCATION_REGION,COMPANY_LOCATION_METRO,COMPANY_LOCATION_COUNTRY,COMPANY_LOCATION_CONTINENT,COMPANY_LOCATION_STREET_ADDRESS,COMPANY_LOCATION_ADDRESS_LINE_2,COMPANY_LOCATION_POSTAL_CODE,ROW_NUM,CURRENT_EMPLOYEES,TOTAL_EMPLOYEES
0,2024-06-16,QkRXus0QCRC7Vw0zcBzHdwZwjYzU,thrive africa (now nomadi),nonprofit,NaN,notion.so/thriveafricafund/overview-46a085735e...,NaN,linkedin.com/company/join-nomadi,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,5,66

In [4]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 170825 entries, 0 to 170824
Data columns (total 26 columns):
 #   Column                           Non-Null Count   Dtype
---  ------                           --------------   -----
 0   DS                               170825 non-null  object
 1   PDL_COMPANY_ID                   170825 non-null  object
 2   COMPANY_NAME                     170825 non-null  object
 3   TYPE                             170825 non-null  object
 4   INDUSTRY                         122732 non-null  object
 5   WEBSITE                          170825 non-null  object
 6   FOUNDED                          79329 non-null   float64
 7   LINKEDIN_URL                     170825 non-null  object
 8   PDL_SUMMARY                      0 non-null       float64
 9   FACEBOOK_URL                     18443 non-null   object
 10  LINKEDIN_ID                      170355 non-null  float64
 11  SIZE                             170825 non-null  object
 12  TICKER                           313 non-null     object
 13  TWITTER_URL                      15806 non-null   object
 14  COMPANY_LOCATION_NAME            155761 non-null  object
 15  COMPANY_LOCATION_LOCALITY        116508 non-null  object
 16  COMPANY_LOCATION_REGION          133858 non-null  object
 17  COMPANY_LOCATION_METRO           55714 non-null   object
 18  COMPANY_LOCATION_COUNTRY         155759 non-null  object
 19  COMPANY_LOCATION_CONTINENT       155761 non-null  object
 20  COMPANY_LOCATION_STREET_ADDRESS  59991 non-null   object
 21  COMPANY_LOCATION_ADDRESS_LINE_2  8577 non-null    object
 22  COMPANY_LOCATION_POSTAL_CODE     62120 non-null   object
 23  ROW_NUM                          170825 non-null  int64
 24  CURRENT_EMPLOYEES                170825 non-null  int64
 25  TOTAL_EMPLOYEES                  170825 non-null  int64
dtypes: float64(3), int64(3), object(20)
memory usage: 33.9+ MB

In [5]:
data3 = pd.read_csv('data/Private Holdings.csv')
data3.head(1)

  Unnamed: 0 Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4 Unnamed: 5 Unnamed: 6
0    Company    Website        Geo     Ticker    Company    Website        Geo

In [6]:
data3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 201 entries, 0 to 200
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  201 non-null    object
 1   Unnamed: 1  201 non-null    object
 2   Unnamed: 2  201 non-null    object
 3   Unnamed: 3  1 non-null      object
 4   Unnamed: 4  1 non-null      object
 5   Unnamed: 5  1 non-null      object
 6   Unnamed: 6  1 non-null      object
dtypes: object(7)
memory usage: 11.1+ KB